{"format": "keras", "nodes": [{"name": "vgg16_input", "id": "vgg16_input", "class_name": "InputLayer", "output_shape": [[null, 32, 32, 3]], "num_parameters": 0}, {"name": "vgg16", "id": "vgg16", "class_name": "Functional", "output_shape": [null, 1, 1, 512], "num_parameters": 14714688}, {"name": "max_pooling2d_1", "id": "max_pooling2d_1", "class_name": "MaxPooling2D", "output_shape": [null, 1, 1, 512], "num_parameters": 0}, {"name": "flatten_1", "id": "flatten_1", "class_name": "Flatten", "output_shape": [null, 512], "num_parameters": 0}, {"name": "dense_2", "id": "dense_2", "class_name": "Dense", "output_shape": [null, 4096], "num_parameters": 2101248}, {"name": "dropout_1", "id": "dropout_1", "class_name": "Dropout", "output_shape": [null, 4096], "num_parameters": 0}, {"name": "dense_3", "id": "dense_3", "class_name": "Dense", "output_shape": [null, 12], "num_parameters": 49164}], "edges": [["vgg16_input", "vgg16"], ["vgg16", "max_pooling2d_1"], ["max_pooling2d_1", "flatten_1"], ["flatten_1", "dense_2"], ["dense_2", "dropout_1"], ["dropout_1", "dense_3"]]}