{"format": "keras", "nodes": [{"name": "vgg16_input", "id": "vgg16_input", "class_name": "InputLayer", "output_shape": [[null, 32, 32, 3]], "num_parameters": 0}, {"name": "vgg16", "id": "vgg16", "class_name": "Functional", "output_shape": [null, 1, 1, 512], "num_parameters": 14714688}, {"name": "max_pooling2d_4", "id": "max_pooling2d_4", "class_name": "MaxPooling2D", "output_shape": [null, 1, 1, 512], "num_parameters": 0}, {"name": "flatten_4", "id": "flatten_4", "class_name": "Flatten", "output_shape": [null, 512], "num_parameters": 0}, {"name": "dense_8", "id": "dense_8", "class_name": "Dense", "output_shape": [null, 4096], "num_parameters": 2101248}, {"name": "dropout_4", "id": "dropout_4", "class_name": "Dropout", "output_shape": [null, 4096], "num_parameters": 0}, {"name": "dense_9", "id": "dense_9", "class_name": "Dense", "output_shape": [null, 11], "num_parameters": 45067}], "edges": [["vgg16_input", "vgg16"], ["vgg16", "max_pooling2d_4"], ["max_pooling2d_4", "flatten_4"], ["flatten_4", "dense_8"], ["dense_8", "dropout_4"], ["dropout_4", "dense_9"]]}