{"format": "keras", "nodes": [{"name": "vgg16_input", "id": "vgg16_input", "class_name": "InputLayer", "output_shape": [[null, 32, 32, 3]], "num_parameters": 0}, {"name": "vgg16", "id": "vgg16", "class_name": "Functional", "output_shape": [null, 1, 1, 512], "num_parameters": 14714688}, {"name": "max_pooling2d_5", "id": "max_pooling2d_5", "class_name": "MaxPooling2D", "output_shape": [null, 1, 1, 512], "num_parameters": 0}, {"name": "flatten_5", "id": "flatten_5", "class_name": "Flatten", "output_shape": [null, 512], "num_parameters": 0}, {"name": "dense_10", "id": "dense_10", "class_name": "Dense", "output_shape": [null, 4096], "num_parameters": 2101248}, {"name": "dropout_5", "id": "dropout_5", "class_name": "Dropout", "output_shape": [null, 4096], "num_parameters": 0}, {"name": "dense_11", "id": "dense_11", "class_name": "Dense", "output_shape": [null, 11], "num_parameters": 45067}], "edges": [["vgg16_input", "vgg16"], ["vgg16", "max_pooling2d_5"], ["max_pooling2d_5", "flatten_5"], ["flatten_5", "dense_10"], ["dense_10", "dropout_5"], ["dropout_5", "dense_11"]]}