{"format": "keras", "nodes": [{"name": "vgg16_input", "id": "vgg16_input", "class_name": "InputLayer", "output_shape": [[null, 32, 32, 3]], "num_parameters": 0}, {"name": "vgg16", "id": "vgg16", "class_name": "Functional", "output_shape": [null, 1, 1, 512], "num_parameters": 14714688}, {"name": "max_pooling2d_3", "id": "max_pooling2d_3", "class_name": "MaxPooling2D", "output_shape": [null, 1, 1, 512], "num_parameters": 0}, {"name": "flatten_3", "id": "flatten_3", "class_name": "Flatten", "output_shape": [null, 512], "num_parameters": 0}, {"name": "dense_6", "id": "dense_6", "class_name": "Dense", "output_shape": [null, 4096], "num_parameters": 2101248}, {"name": "dropout_3", "id": "dropout_3", "class_name": "Dropout", "output_shape": [null, 4096], "num_parameters": 0}, {"name": "dense_7", "id": "dense_7", "class_name": "Dense", "output_shape": [null, 12], "num_parameters": 49164}], "edges": [["vgg16_input", "vgg16"], ["vgg16", "max_pooling2d_3"], ["max_pooling2d_3", "flatten_3"], ["flatten_3", "dense_6"], ["dense_6", "dropout_3"], ["dropout_3", "dense_7"]]}